app/controllers/forum_posts_controller.rb

    def index
    posts = ForumPost.all
---
SELECT "forum_posts".* FROM "forum_posts"

    def show
    post = ForumPost.find(params[:id])
---
SELECT "forum_posts".* FROM "forum_posts" WHERE "forum_posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def create
    post = ForumPost.create(forum_post_params)
---
INSERT INTO "forum_posts" ("tenant_id", "text", "created_at", "updated_at", "category") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["tenant_id", 616], ["text", "Test Post, please ignore"], ["created_at", "2022-12-15 16:19:20.760683"], ["updated_at", "2022-12-15 16:19:20.760683"], ["category", "Testing!"]]

    def update
    post = ForumPost.find(params[:id])
    post.update(forum_post_params)
---
SELECT "forum_posts".* FROM "forum_posts" WHERE "forum_posts"."id" = $1 LIMIT $2  [["id", 551], ["LIMIT", 1]]
UPDATE "forum_posts" SET "text" = $1, "updated_at" = $2 WHERE "forum_posts"."id" = $3  [["text", "Did this change?"], ["updated_at", "2022-12-15 16:21:07.425679"], ["id", 551]]

    def destroy
    post = ForumPost.find(params[:id])
    post.destroy
---
SELECT "forum_posts".* FROM "forum_posts" WHERE "forum_posts"."id" = $1 LIMIT $2  [["id", 552], ["LIMIT", 1]]
DELETE FROM "forum_posts" WHERE "forum_posts"."id" = $1  [["id", 552]]