app/controllers/leases_controller.rb

    def index
    leases = Lease.all
---
SELECT "leases".* FROM "leases"

    def show
    lease = Lease.find(params[:id])
---
SELECT "leases".* FROM "leases" WHERE "leases"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

    def create
    lease = Lease.create!(lease_params)
---
INSERT INTO "leases" ("apartment_id", "tenant_id", "move_out_date", "move_in_date", "pets", "pet_count", "lease_start", "lease_end", "rent", "rent_duedate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"