app/controllers/sessions_controller.rb

    def create
        @tenant = Tenant.find_by( email_address: params[:email_address])
---
SELECT "tenants".* FROM "tenants" WHERE "tenants"."email_address" = $1 LIMIT $2  [["email_address", "joe@joe.com"], ["LIMIT", 1]]