app/controllers/tenants_controller.rb

SELECT "tenants".* FROM "tenants"
---
    def index
    tenants = Tenant.all

SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT $2  [["id", 822], ["LIMIT", 1]]
---
    def show
    tenant = Tenant.find(params[:id])

INSERT INTO "tenants" ("first_name", "last_name", "phone_number", "email_address", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
    tenant = Tenant.create!(tenant_params)